lectures/PDAP2018_Lecture-01.org
#+OPTIONS: reveal_center:t reveal_progress:t reveal_history:t reveal_control:t
#+OPTIONS: reveal_mathjax:t reveal_rolling_links:t reveal_keyboard:t reveal_overview:t num:nil
#+OPTIONS: reveal_width:1024 reveal_height:768
#+OPTIONS: reveal_slide_number:c/t
#+OPTIONS: toc:1 todo:nil timestamp:nil
#+REVEAL_MARGIN: 0.2
#+REVEAL_MIN_SCALE: 0.3
#+REVEAL_TRANS: none
#+REVEAL_THEME: sky
#+REVEAL_HLEVEL: 999
#+REVEAL_PLUGINS: (highlight)
#+REVEAL_ROOT: https://cdnjs.cloudflare.com/ajax/libs/reveal.js/3.6.0/

#+TITLE: Practical Data Analysis with Python
#+AUTHOR: Dr. Andreas Hilboll
#+EMAIL: hilboll@uni-bremen.de
#+DATE: 06 April 2018

* DONE Introduction
  CLOSED: [2018-04-05 Thu 11:17]

** Who am I?
   - Andreas Hilboll
   - working at IUP ([[http://www.iup.uni-bremen.de/][Institute of Environmental Physics]])
   - past: PhD in atmospheric remote sensing
   - now: PostDoc in atmospheric modeling / [[http://www.iup.uni-bremen.de/lamos/][LAMOS group]], Prof. Vrekoussis
   - when you need to contact me:

     | E-mail | [[mailto:hilboll@uni-bremen.de][hilboll@uni-bremen.de]]  |
     | Room   | [[http://oracle-web.zfn.uni-bremen.de/lageplan/lageplan?pi_raum_id=8251&pi_raumnummer=S3121&pi_anz=1][S3132]] (formerly S3121) |
     | Phone  | +49(0)421-218-62133    |

** Who are you?

   - Please fill in the participant list.
   - Is there anything in particular you want to learn here?
   - What is your previous experience with Python?
   - What is your previous experience with version control?

* DONE Course overview
  CLOSED: [2018-04-05 Thu 11:26]

** Introduction

   This course is a /practical/ introduction to using Python for data
   analysis.  This means that
   - we start by setting up your computer for use with Python /(today)/
   - we will learn about automatic version control with Git: What is
     it, why should we use it, and how do we do it? /(next week)/
   - we will learn the basics about Python in science /(April-early
     May)/:
     - the basics about arrays
     - reading and writing data in common file formats
     - labeled arrays, or how to intuitively work with data
     - making beautiful and meaningful plots from data

** Practical

   Starting in /mid-May/, we will take an in-depth look at common data
   analysis problems like

   - curve fitting
   - minimization of a cost function
   - parameter estimation
   - correlation analysis

   Also, we can look into special topic libraries which /you/ will want
   to work with (let me know which topics interest you!)
   
** This course is /for you/

   The goal of this course is to *help you learn Python*.  I expect you
   to work independently with the available online material.

   This course is meant to be /practical/ to /you/.  So you are welcome to let me
   know what you would like to learn!

* DONE Course Logistics
  CLOSED: [2018-04-05 Thu 11:43]

** DONE Communication

   - I will use [[https://elearning.uni-bremen.de/][Stud.IP]] to make announcements etc.  So make sure that you register
     for this course
   - If you need to contact me, drop me an [[mailto:hilboll@uni-bremen.de][e-mail]] or come by my office S3132
   - All course material will be uploaded to the Git repository at
     https://github.com/iup-bremen/pdap-2018

** DONE Consultation meetings
   CLOSED: [2018-04-05 Thu 11:43]

   I will offer 15-minute consultation sessions /on Tuesdays/ either for
   individuals or for groups of students.  I will try to offer at
   least two sessions to each student over the course of the semester.
   
   The first time slots will be next week Tuesday; feel free to
   [[https://doodle.com/poll/wi8f8d93azrsy9cr][register]] (first come, first serve).
   
   During the consultation, time is limited, so *please be prepared*!
   The better you know before we meet /what your question actually is/,
   the better I will be able to help you!

     
** Homework

   Sometimes, there will be optional homework assignments.  These can
   either be some practice work, or it could be some preparatory steps
   you have to do on your computer.  In the latter case, having
   completed these steps is required to follow the next class.

** DONE Exam / grades
   CLOSED: [2018-04-05 Thu 11:43]

   There will be four graded homework projects, one every 3--4 weeks:
   - 3 weeks time to complete
   - to be completed in groups of 1--3 students
   - course grade will be arithmetic average of the four homework assignments
* DONE Reading material
  CLOSED: [2018-04-05 Thu 16:28]

  Reading material is available in the file =REFERENCES.rst= in the
  course repository.  This file will be continuously updated as the
  semester goes on.

* DONE Practical excercise: Setting up your computer
  CLOSED: [2018-04-05 Thu 16:47]

  Install instructions to set up Python on your computer are provided
  in the file [[https://github.com/iup-bremen/pdap-2018/blob/master/INSTALL.rst][INSTALL.rst]] in the course repository.

* TODO Practical exercise: Familiarize yourself with the Notebook

  Now that Jupterlab is running on your computer, start familiarizing
  yourself with it.  As a starting point, you might want to read
  through
  https://jupyter-notebook-beginner-guide.readthedocs.io/en/latest/what_is_jupyter.html
  and work through the exercises in
  https://swcarpentry.github.io/python-novice-gapminder/01-run-quit/

  
* DONE Final remarks
  CLOSED: [2018-04-05 Thu 16:08]

  - If you haven't managed to install Python, I encourage you to try a
    little longer.  If you still need assistance, feel free to
    [[https://doodle.com/poll/wi8f8d93azrsy9cr][schedule a consultation session]].
  - The slides for this course are available in Stud.IP.

*Thank you*
